app/controllers/sessions_controller.rb

INSERT INTO "users" ("provider", "uid", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["provider", "facebook"], ["uid", "323384914520322"], ["name", "Jay Elbourne"], ["created_at", "2015-02-13 05:22:45.552409"], ["updated_at", "2015-02-13 05:22:45.552409"]]
SELECT  "users".* FROM "users" WHERE "users"."provider" = $1 AND "users"."uid" = $2  ORDER BY "users"."id" ASC LIMIT 1  [["provider", "facebook"], ["uid", "323384914520322"]]
---
  def create
    auth = request.env["omniauth.auth"]
    user = User.where(:provider => auth['provider'],
                      :uid => auth['uid'].to_s).first || User.create_with_omniauth(auth)